000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. DISPLAY.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600* cobc -x -v display.cbl
000700 PROGRAM-BEGIN.
000800     DISPLAY "This program contains four DIVISIONS ".
000900     DISPLAY "three PARAGRAPHS ".
001000     DISPLAY "and four SENTENCES ".
001100 PROGRAM-DONE.
001200     STOP RUN.
