000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. EX-0201.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600* cobc -x -v EX-0201.cbl
000700 PROGRAM-BEGIN.
000800     DISPLAY "I said, Hello world".
000900
001000 PROGRAM-DONE.
001100     STOP RUN.

