000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MINIMUM.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600* cobc -x -v minimum.cbl
000700 PROGRAM-DONE.
000800     STOP RUN.
