000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. WELCOME.
000030 ENVIRONMENT DIVISION.
000040 DATA DIVISION.
000050 PROCEDURE DIVISION.
000060
000070 PROGRAM-BEGIN.
000080     DISPLAY "Welcome to GNU COBOL".
000090
000100 PROGRAM-DONE.
000110     STOP RUN.
